modules/ome-java.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Oh My Emacs Java</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Oh My Emacs Java"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-30T17:03+0800"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Oh My Emacs Java</h1>

<p>This is part of the <a href="https://github.com/xiaohanyu/oh-my-emacs">oh-my-emacs</a>.
</p>

<div id="outline-container-java-prerequisites" class="outline-2">
<h2 id="java-prerequisites"><a name="sec-1" id="sec-1"></a>Prerequisites</h2>
<div class="outline-text-2" id="text-java-prerequisites">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>Prerequisites for ome-java module</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"></th><th scope="col" class="left">Windows</th><th scope="col" class="left">Ubuntu/Debian/Mint</th><th scope="col" class="left">ArchLinux</th><th scope="col" class="left">Fedora</th><th scope="col" class="left">Mac OS X</th><th scope="col" class="left">Mandatory?</th></tr>
</thead>
<tbody>
<tr><td class="left"><a href="http://www.eclipse.org/">eclipse</a></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">Yes</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-java-el-get-packages" class="outline-2">
<h2 id="java-el-get-packages"><a name="sec-2" id="sec-2"></a>El-get packages</h2>
<div class="outline-text-2" id="text-java-el-get-packages">



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>El-get packages for ome-java module</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"></th><th scope="col" class="left">Status</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left"><a href="https://github.com/senny/emacs-eclim">emacs-eclim</a></td><td class="left">Required</td><td class="left">The bridge between emacs and eclipse.</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-eclim" class="outline-2">
<h2 id="eclim"><a name="sec-3" id="sec-3"></a>Eclim</h2>
<div class="outline-text-2" id="text-eclim">


<blockquote>

<p>Emacs was a really great idea in the seventies and one of the frightening
things about Emacs today is if you skip the last 20 years it is much the same.
</p>
<p>
&ndash; <a href="http://www.computerworld.com.au/article/207799/don_t_use_emacs_says_java_father/">Don't use Emacs, says Java's father</a>
</p>
</blockquote>


<p>
I must say that it is really a pain to do Java programming with Emacs,
however, when I turn to a modern IDE(eclipse/netbeans), just as Java's father
said, I would miss Emacs again. You want to know why? Refer to <a href="http://gnuvince.wordpress.com/2012/02/19/why-i-still-use-emacs/">Why I Still Use Emacs</a>.
</p>
<p>
However, Eclipse, or some other java IDEs, do provide some fascinating features
such as refactoring, 100% absolutely correct semantic completion, on-the-fly
syntax checking, maven/ant integration, etc.
</p>
<p>
Fortunately, there comes <a href="https://github.com/senny/emacs-eclim">emacs-eclim</a>, which brings the power of Eclipse to
Emacs by utilizing <a href="http://eclim.org/">eclim</a>, ah, the best of both world.
</p>
<p>
To install eclim, first you need to install Eclipse. You can install Eclipse
through your OS package manager, or you can download a tarball directly from
<a href="http://www.eclipse.org/downloads/">official eclipse website</a>. I recommend the later method since it is much more
portable, and dumps all eclipse files to a single folder, say, <code>/opt/eclipse/</code>
for example. And one extra advice, I recommend you install Eclipse version 3.x
instead of 4.x since 4.x is not stable enough IMHO. My working environments
include Eclipse 3.7 and eclim_1.7.18. I didn't have too much time to test
other combinations, so if you encounter problems, don't hesitate to open a new
issue in oh-my-emacs's github.
</p>
<p>
Then you should download and install eclim, see <a href="http://eclim.org/install.html">eclim install guide</a> for
details. I use the following command to do an automated install.
</p>



<pre class="example">java -Dvim.files=$HOME/.vim -Declipse.home=/opt/eclipse -jar eclim_1.7.18.jar install
</pre>


<p>
Oh-my-emacs assumes that you install Eclipse to <code>/opt/eclipse/</code> directory, and
set your Eclipse workspace to <code>$HOME/workspace</code>. So if your settings are
different, don't forget to set <code>eclim-executable</code> and <code>eclimd-executable</code>
properly. Finally, ensure that you can find <code>eclipse</code> in your shell's <code>$PATH</code>
since oh-my-emacs relies on this way to determine the availability of Eclipse.
</p>
<p>
Ok, that's enough, you want to know what eclim can provide for you? <a href="http://www.skybert.net/emacs/java/">Enterprise Java Development in Emacs</a> show you an illustrated guide.
</p>



<pre class="example">(defun ome-eclim-setup ()
  ;; (add-to-list 'eclim-eclipse-dirs "/opt/eclipse")
  (setq eclim-auto-save t
        eclim-executable (or (executable-find "eclim") "/opt/eclipse/eclim")
        eclimd-executable (or (executable-find "eclimd") "/opt/eclipse/eclimd")
        eclimd-wait-for-process nil
        eclimd-default-workspace "~/workspace/"
        help-at-pt-display-when-idle t
        help-at-pt-timer-delay 0.1)

  ;; Call the help framework with the settings above &amp; activate
  ;; eclim-mode
  (help-at-pt-set-timer)

  ;; keep consistent which other auto-complete backend.
  (custom-set-faces
   '(ac-emacs-eclim-candidate-face ((t (:inherit ac-candidate-face))))
   '(ac-emacs-eclim-selection-face ((t (:inherit ac-selection-face)))))

  ;; Hook eclim up with auto complete mode
  (require 'ac-emacs-eclim-source)
  ;; (ac-emacs-eclim-config)

  (require 'eclimd)

  (add-hook 'java-mode-hook
            (lambda ()
              (add-to-list 'ac-sources 'ac-source-emacs-eclim)
              (eclim-mode t))))

(when (executable-find "eclipse")
  (ome-install 'eclim))
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Todo</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>Complitation support, use <code>M-n</code> and <code>M-p</code> to navigate the eclim warnings and
  errors just like <code>c-mode</code> and <code>c++-mode</code>.
</li>
<li>Provide a menubar to eclim thus users can get a quick overview of eclim
  features.
</li>
<li>Eclim would report warnings like <code>describe-mode: Symbol's function definition   is void: eclim-project-mode</code> when you hit <code>C-h m</code> in auxiliary eclim modes.
</li>
</ul>

</div>
</div>
</div>

</body>
</html>
